Revit 2027 API
ViewHVACLoadsReport.RunLoadsAnalysis Method
 Performs a heating and cooling loads analysis for zones and spaces in the energy model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RunLoadsAnalysis()
Public Sub RunLoadsAnalysis
public:
void RunLoadsAnalysis()
member RunLoadsAnalysis : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  A valid energy model is required for loads analysis.
Remarks
 Should be called from a transaction.
See Also
Reference
ViewHVACLoadsReport Class
Autodesk.Revit.DB.Analysis Namespace